# EnergyAnalysisPercentageSkylights Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisPercentageSkylights Property
ParameterTypeId Class See Also
---
"Target Percentage Skylights"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisPercentageSkylights { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisPercentageSkylights As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisPercentageSkylights {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace